---
kind: other
id: Methods.T:Autodesk.Revit.DB.ElementParameterFilter
source: html/e53152d6-638b-7138-9187-5c26f476b0b9.htm
---
# ElementParameterFilter Methods

Returns the set of rules contained in this filter.